---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimToInsertType
source: html/49bcb584-3f98-3efd-bb79-70d5dbbd9565.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimToInsertType Property

"Dimension To Opening Type"

## Syntax (C#)
```csharp
public static ForgeTypeId DimToInsertType { get; }
```